app/Controllers/AcademicCalender.php

    public function index()
    {
        $model = new AcademicCalenderModel();

        $data['calenders'] = $model
            ->orderBy('year', 'DESC')
            ->findAll();
---
SELECT *
FROM `academic_calender`
ORDER BY `year` DESC

    public function add()
    {
        $model = new AcademicCalenderModel();
        $file  = $this->request->getFile('image');

        $image = null;
        if ($file && $file->isValid() && !$file->hasMoved()) {
            $image = $file->getRandomName();
            $file->move('uploads/academic-calender', $image);
        }

        $model->insert([
            'year'      => $this->request->getPost('year'),
            'image'     => $image,
            'is_active' => $this->request->getPost('is_active') ?? 1
        ]);
---
INSERT INTO `academic_calender` (`year`, `image`, `is_active`, `created_at`, `updated_at`) VALUES ('2022/2023', '1768062585_f6e50869892a9807f58e.png', '1', '2026-01-10 16:29:45', '2026-01-10 16:29:45')