app/Controllers/AgenPerubahan.php

    public function index()
    {
        $model = new AgenPerubahanModel();

        $data['rows'] = $model
            ->orderBy('agen_id', 'DESC')
            ->findAll();
---
SELECT *
FROM `agen_perubahan`
ORDER BY `agen_id` DESC