app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        $model = new AgenPerubahanModel();

        $this->agen_perubahan = $model
            ->where('is_active', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();

        // ✅ INI YANG BENAR
        service('renderer')->setVar('agen_perubahan', $this->agen_perubahan);

        $model = new LayananPublicModel();

        $this->layanan_public = $model
            ->where('is_active', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();

        // inject ke semua view
        service('renderer')->setVar('layanan_public', $this->layanan_public);

        $modelPpid = new PpidModel();

        $this->ppid = $modelPpid
            ->where('is_active', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `agen_perubahan`
WHERE `is_active` = 1
ORDER BY `created_at` DESC
SELECT *
FROM `layanan_public`
WHERE `is_active` = 1
ORDER BY `created_at` DESC
SELECT *
FROM `ppid`
WHERE `is_active` = 1
ORDER BY `created_at` DESC


        $modelMadrasah = new LayananMadrasahModel();

        $this->layanan_madrasah = $modelMadrasah
            ->where('is_active', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `layanan_madrasah`
WHERE `is_active` = 1
ORDER BY `created_at` DESC


        $modelEkskul = new EkstrakulikulerModel();

        $this->ekstrakulikuler = $modelEkskul
            ->where('is_active', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `ekstrakulikuler`
WHERE `is_active` = 1
ORDER BY `created_at` DESC


        $modelKeterampilan = new KeterampilanModel();

        $this->keterampilan = $modelKeterampilan
            ->where('is_active', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `keterampilan`
WHERE `is_active` = 1
ORDER BY `created_at` DESC


        $modelPtmt = new PtmtModel();

        $this->ptmt = $modelPtmt
            ->where('is_active', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `ptmt`
WHERE `is_active` = 1
ORDER BY `created_at` DESC