app/Controllers/Ekstrakulikuler.php

INSERT INTO `ekstrakulikuler` (`header`, `image`, `content`, `is_active`, `created_at`, `updated_at`) VALUES ('PMR', '1770908106_d5029ab8208b4a984c5a.jpeg', '<p>Palang Merah Remaja (PMR) MAN 1 Mandailing Natal merupakan organisasi ekstrakurikuler yang bergerak di bidang kemanusiaan, kesehatan, dan kepedulian sosial. PMR menjadi wadah pembinaan karakter peserta didik agar memiliki sikap empati, disiplin, tanggung jawab, serta kesiapsiagaan dalam membantu sesama.</p>\r\n\r\n<p><strong>Melalui kegiatan PMR,</strong> peserta didik dibekali pengetahuan dan keterampilan dasar pertolongan pertama (P3K), perawatan kesehatan, kebersihan lingkungan, serta penanganan keadaan darurat. Selain itu, anggota PMR juga dilatih untuk bekerja sama dalam tim, sigap, dan tenang dalam menghadapi berbagai situasi.</p>\r\n\r\n<p>PMR MAN 1 Mandailing Natal aktif dalam kegiatan sosial seperti bakti kemanusiaan, pelayanan kesehatan sederhana, donor darah, serta dukungan kesehatan pada kegiatan madrasah. Nilai-nilai kemanusiaan, kepemimpinan, dan solidaritas menjadi landasan utama dalam setiap aktivitas yang dilakukan.</p>\r\n\r\n<p>Dengan semangat kemanusiaan dan pengabdian, PMR MAN 1 Mandailing Natal berkomitmen mencetak generasi muda yang peduli, tangguh, dan siap berkontribusi positif bagi lingkungan sekolah maupun masyarakat luas.</p>\r\n', 1, '2026-02-12 14:55:06', '2026-02-12 14:55:06')
---
    public function add()
    {
        $model = new EkstrakulikulerModel();

        $image = $this->request->getFile('image');
        $imageName = $image->getRandomName();
        $image->move('uploads/ekstrakulikuler', $imageName);

        $model->insert([
            'header'    => $this->request->getPost('header'),
            'image'     => $imageName,
            'content'   => $this->request->getPost('content'),
            'is_active' => $this->request->getPost('is_active') ? 1 : 0,
        ]);

SELECT *
FROM `ekstrakulikuler`
WHERE `ekstrakulikuler_id` = '1'
AND `is_active` = 1
 LIMIT 1
---
    public function detail($id)
    {
        $model = new EkstrakulikulerModel();

        $data['ekskul'] = $model
            ->where('ekstrakulikuler_id', $id)
            ->where('is_active', 1)
            ->first();