app/Controllers/Home.php

    public function index(): string
    {
        // Opening
        $openingModel = new OpeningModel();
        $data['opening'] = $openingModel
            ->where('is_active', 1)
            ->orderBy('opening_id', 'DESC')
            ->first();

        // Vision & Mission
        $vmModel = new ProfileVisionMissionModel();

        $data['vision'] = $vmModel
            ->where('type', 'visi')
            ->orderBy('id', 'DESC')
            ->first();

        $data['mission'] = $vmModel
            ->where('type', 'misi')
            ->orderBy('id', 'DESC')
            ->first();

        // History (Timeline)
        $historyModel = new ProfileHistoryModel();
        $data['histories'] = $historyModel
            ->orderBy('tahun', 'ASC')
            ->findAll();

        $newsModel = new NewsModel();
        // Highlight (1 data terbaru)
        $data['news_highlight'] = $newsModel
            ->where('type', 'highlight')
            ->where('is_active', 1)
            ->orderBy('news_id', 'DESC')
            ->first();
---
SELECT *
FROM `opening`
WHERE `is_active` = 1
ORDER BY `opening_id` DESC
 LIMIT 1
SELECT *
FROM `profile_vision_mission`
WHERE `type` = 'visi'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `profile_vision_mission`
WHERE `type` = 'misi'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `profile_history`
ORDER BY `tahun` ASC
SELECT *
FROM `news`
WHERE `type` = 'highlight'
AND `is_active` = 1
ORDER BY `news_id` DESC
 LIMIT 1

        helper('text');


        $data['news'] = $newsModel
            ->where('is_active', 1)
            ->orderBy('news_id', 'DESC')
            ->findAll(6); // bebas, 4 / 6 / 8 sesuai layout

        $announcementModel = new \App\Models\AnnouncementModel();

        $data['announcement'] = $announcementModel
            ->where('is_active', 1)
            ->orderBy('announcement_id', 'DESC')
            ->first();
---
SELECT *
FROM `news`
WHERE `is_active` = 1
ORDER BY `news_id` DESC
 LIMIT 6
SELECT *
FROM `announcement`
WHERE `is_active` = 1
ORDER BY `announcement_id` DESC
 LIMIT 1