app/Controllers/Keterampilan.php

SELECT *
FROM `keterampilan`
ORDER BY `keterampilan_id` DESC
---
    public function index()
    {
        $model = new KeterampilanModel();

        $data['rows'] = $model
            ->orderBy('keterampilan_id', 'DESC')
            ->findAll();

SELECT *
FROM `keterampilan`
WHERE `keterampilan_id` = '3'
AND `is_active` = 1
 LIMIT 1
---
    public function detail($id)
    {
        $model = new KeterampilanModel();

        $data['keterampilan'] = $model
            ->where('keterampilan_id', $id)
            ->where('is_active', 1)
            ->first();