app/Controllers/LimaBudaya.php

INSERT INTO `lima_budaya` (`header`, `image`, `is_active`, `created_at`, `updated_at`) VALUES ('Lima Budaya Kementria', '1770910477_efc5a76df2ba025f6b8f.jpg', 1, '2026-02-12 15:34:37', '2026-02-12 15:34:37')
---
    public function add()
    {
        $model = new LimaBudayaModel();

        $image = $this->request->getFile('image');
        $imageName = $image->getRandomName();
        $image->move('uploads/lima-budaya', $imageName);

        $model->insert([
            'header'    => $this->request->getPost('header'),
            'image'     => $imageName,
            'is_active' => $this->request->getPost('is_active') ? 1 : 0,
        ]);