app/Controllers/Menu.php

    public function index()
    {
        $model = new ProfileHistoryModel();

        // SELECT TOP 1 (latest data)
        $data['history'] = $model
            ->orderBy('history_id', 'DESC')
            ->findAll();
---
SELECT *
FROM `profile_history`
ORDER BY `history_id` DESC

    public function delete($id)
    {
        $model = new ProfileHistoryModel();

        // optional: hapus file image juga
        $data = $model->find($id);
        if ($data && $data['image']) {
            $path = ROOTPATH . 'public/uploads/' . $data['image'];
            if (file_exists($path)) {
                unlink($path);
            }
        }

        $model->delete($id);
---
SELECT *
FROM `profile_history`
WHERE `profile_history`.`history_id` = '4'
DELETE FROM `profile_history`
WHERE `history_id` IN ('4')