app/Controllers/OrganizationStructure.php

    public function index()
    {
        $model = new ProfileOrganizationStructureModel();

        $data['org_structures'] = $model
            ->orderBy('organization_id', 'DESC')
            ->findAll();
---
SELECT *
FROM `profile_organization_structure`
ORDER BY `organization_id` DESC

    public function add()
    {
        $model = new ProfileOrganizationStructureModel();

        $file = $this->request->getFile('image');

        if ($file && $file->isValid() && !$file->hasMoved()) {
            $newName = $file->getRandomName();
            $file->move('uploads/organization', $newName);

            $model->insert([
                'image' => $newName
            ]);
---
INSERT INTO `profile_organization_structure` (`image`, `created_at`, `updated_at`) VALUES ('1770215716_33c5a0e197fe13f70c5d.png', '2026-02-04 14:35:16', '2026-02-04 14:35:16')