app/Controllers/OutUkbm.php

    public function index()
    {
        $data['ukbm'] = $this->model
            ->where('is_active', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `ukbm`
WHERE `is_active` = 1
ORDER BY `created_at` DESC