app/Controllers/PengendalianIntern.php

SELECT *
FROM `pengendalian_intern`
ORDER BY `pengendalian_intern_id` DESC
---
    public function index()
    {
        $model = new PengendalianInternModel();

        $data['rows'] = $model
            ->orderBy('pengendalian_intern_id', 'DESC')
            ->findAll();