app/Controllers/PlanStrategic.php

    public function index()
    {
        helper('text');

        $model = new PlanStrategicModel();
        $data['plans'] = $model
            ->orderBy('year', 'DESC')
            ->findAll();
---
SELECT *
FROM `plan_strategic`
ORDER BY `year` DESC