app/Controllers/ProfileTeacherDetail.php

INSERT INTO `profile_teacher_detail` (`image`, `name`, `education`, `sex`, `birth_date`, `level`, `role`, `created_at`, `updated_at`) VALUES ('1770217023_6aa4dfbc109eb80f6e03.jpeg', 'Yasir 2', 'D3', 'Laki-laki', '2026-02-04', 'SMA', 'Guru Mata Pelajaran', '2026-02-04 14:57:03', '2026-02-04 14:57:03')
---
    public function add()
    {
        $model = new ProfileTeacherDetailModel();
        $file = $this->request->getFile('image');

        if ($file && $file->isValid() && !$file->hasMoved()) {
            $newName = $file->getRandomName();
            $file->move('uploads/teacher_detail', $newName);

            $model->insert([
                'image'       => $newName,
                'name'        => $this->request->getPost('name'),
                'education'   => $this->request->getPost('education'),
                'sex'         => $this->request->getPost('sex'),
                'birth_date'  => $this->request->getPost('birth_date'),
                'level'       => $this->request->getPost('level'),
                'role'        => $this->request->getPost('role'),
            ]);