app/Controllers/ProfileLocation.php

SELECT *
FROM `profile_location`
ORDER BY `location_id` DESC
---
    public function index()
    {
        $model = new ProfileLocationModel();

        $data['locations'] = $model
            ->orderBy('location_id', 'DESC')
            ->findAll();