app/Controllers/ProfileInfrastructure.php

    public function add()
    {
        $model = new ProfileInfrastructureModel();
        $file  = $this->request->getFile('image');

        if ($file && $file->isValid() && !$file->hasMoved()) {
            $newName = $file->getRandomName();
            $file->move('uploads/infrastructure', $newName);

            $model->insert([
                'image'  => $newName,
                'header' => $this->request->getPost('header'),
                'detail' => $this->request->getPost('detail'),
            ]);
---
INSERT INTO `profile_infrastructure` (`image`, `header`, `detail`, `created_at`, `updated_at`) VALUES ('1767886039_070b51fccc7bdc261aa6.png', 'asdsad', '<p>asdsadadasdasadsadasdadasdas</p>\r\n', '2026-01-08 15:27:19', '2026-01-08 15:27:19')