app/Controllers/Ptmt.php

SELECT *
FROM `ptmt`
ORDER BY `ptmt_id` DESC
---
    public function index()
    {
        $model = new PtmtModel();

        $data['rows'] = $model
            ->orderBy('ptmt_id', 'DESC')
            ->findAll();