app/Controllers/RelasiBelanja.php

    public function index()
    {
        $model = new RelasiBelanjaModel();

        $data['rows'] = $model
            ->orderBy('relasi_belanja_id', 'DESC')
            ->findAll();
---
SELECT *
FROM `relasi_belanja`
ORDER BY `relasi_belanja_id` DESC