app/Controllers/RencanaStrategis.php

    public function index()
    {
        $model = new PlanStrategicModel();

        $data['plans'] = $model
            ->where('is_active', 1)
            ->orderBy('year', 'DESC')
            ->findAll();
---
SELECT *
FROM `plan_strategic`
WHERE `is_active` = 1
ORDER BY `year` DESC