app/Controllers/VisiMisi.php

SELECT *
FROM `profile_vision_mission`
WHERE `type` = 'visi'
 LIMIT 1
SELECT *
FROM `profile_vision_mission`
WHERE `type` = 'misi'
---
    public function index()
    {
        $model = new ProfileVisionMissionModel();

        $data['visi'] = $model->where('type', 'visi')->first();
        $data['misi'] = $model->where('type', 'misi')->findAll();