app/Controllers/VisionMission.php

SELECT *
FROM `profile_vision_mission`
ORDER BY `id` DESC
---
    public function index(): string
    {
        $model = new ProfileVisionMissionModel();

        // SELECT TOP 1 (latest data)
        $data['vision_mission'] = $model
            ->orderBy('id', 'DESC')
            ->findAll();

INSERT INTO `profile_vision_mission` (`type`, `content`, `created_at`, `updated_at`) VALUES ('visi', '<ul>\r\n	<li>&nbsp;asdasdasdkasdkas</li>\r\n	<li>asdaskdjaksjdaksjdksajd</li>\r\n	<li>asdaskdalskdlaskdasd</li>\r\n	<li>alskdalskdlaskdlaskdl</li>\r\n</ul>\r\n', '2026-01-01 14:59:42', '2026-01-01 14:59:42')
---
    public function add()
    {
        $model = new ProfileVisionMissionModel();

        $model->insert([
            'type' => $this->request->getPost('type'),
            'content' => $this->request->getPost('content'),
        ]);