app/Controllers/WhistleBlowing.php

SELECT *
FROM `whistle_blowing`
ORDER BY `w_blowing_id` DESC
---
    public function index()
    {
        $model = new WhistleBlowingModel();

        $data['rows'] = $model
            ->orderBy('w_blowing_id', 'DESC')
            ->findAll();